backend/monolith-app/load-tests/artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    # Ramp up phase
    - duration: 120
      arrivalRate: 10
      rampTo: 30
      name: "Ramp up load"
    # Sustained load phase
    - duration: 180
      arrivalRate: 50
      name: "Sustained load"
    # Spike test
    - duration: 60
      arrivalRate: 100
      name: "Spike test"
  processor: "./processor.js"
  
scenarios:
  # Health check scenario
  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  # Authentication scenario
  - name: "User Login"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "Password123!"
          capture:
            - json: "$.accessToken"
              as: "token"
          expect:
            - statusCode: 200

  # Product listing scenario
  - name: "Get Products"
    weight: 30
    flow:
      - get:
          url: "/api/products?page=1&limit=20"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
            - contentType: json

  # Product detail scenario
  - name: "Get Product Detail"
    weight: 15
    flow:
      - get:
          url: "/api/products/{{ $randomString() }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: [200, 404]

  # Order creation scenario
  - name: "Create Order"
    weight: 20
    flow:
      - post:
          url: "/api/orders"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            customerId: "{{ $randomString() }}"
            items:
              - productId: "{{ $randomString() }}"
                quantity: 2
                price: 100
          expect:
            - statusCode: [201, 400, 404]

  # Inventory check scenario
  - name: "Check Inventory"
    weight: 10
    flow:
      - get:
          url: "/api/inventory?warehouseId={{ $randomString() }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: [200, 404]